In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://sms_user:sms_password@localhost:5432/sms_db

env: DATABASE_URL=postgresql://sms_user:sms_password@localhost:5432/sms_db

In [3]:
%sql SELECT * FROM users

6 rows affected.

[(1, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'U', False, datetime.datetime(2021, 12, 8, 1, 5, 44, 352125), datetime.datetime(2021, 12, 8, 1, 5, 44, 352125)),
 (2, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2021, 12, 8, 1, 7, 32, 519242), datetime.datetime(2021, 12, 8, 1, 7, 32, 519242)),
 (3, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', False, datetime.datetime(2021, 12, 8, 1, 8, 26, 206646), datetime.datetime(2021, 12, 8, 1, 8, 26, 206646)),
 (4, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', True, datetime.datetime(2021, 12, 8, 1, 9, 12, 925557), datetime.datetime(2021, 12, 8, 1, 9, 12, 925557)),
 (5, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', True, datetime.datetime(2021, 12, 8, 1, 9, 12, 925557), datetime.datetime(2021, 12, 8, 1, 9, 12, 925557)),
 (6, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', True, datetime.datetime(2021, 12, 8, 1, 9, 12, 925557), datetime.datetime(2021, 12, 8, 1, 9, 12, 925557))]

In [4]:
%%sql
UPDATE users
    SET user_role = 'A'
WHERE user_id = 1

 * postgresql://sms_user:***@localhost:5432/sms_db
1 rows affected.

[]

In [6]:
%sql SELECT * FROM users ORDER BY user_id

 * postgresql://sms_user:***@localhost:5432/sms_db
6 rows affected.

[(1, 'Scott', 'Tiger', 'scott@tiger.com', False, None, 'A', False, datetime.datetime(2021, 12, 8, 1, 5, 44, 352125), datetime.datetime(2021, 12, 8, 1, 5, 44, 352125)),
 (2, 'Donald', 'Duck', 'donald@duck.com', False, None, 'U', False, datetime.datetime(2021, 12, 8, 1, 7, 32, 519242), datetime.datetime(2021, 12, 8, 1, 7, 32, 519242)),
 (3, 'Mickey', 'Mouse', 'mickey@mouse.com', False, None, 'U', False, datetime.datetime(2021, 12, 8, 1, 8, 26, 206646), datetime.datetime(2021, 12, 8, 1, 8, 26, 206646)),
 (4, 'Gordan', 'Bradock', 'gbradock0@barnesandnoble.com', False, 'h9LAz7p7ub', 'U', True, datetime.datetime(2021, 12, 8, 1, 9, 12, 925557), datetime.datetime(2021, 12, 8, 1, 9, 12, 925557)),
 (5, 'Tobe', 'Lyness', 'tlyness1@paginegialle.it', False, 'oEofndp', 'U', True, datetime.datetime(2021, 12, 8, 1, 9, 12, 925557), datetime.datetime(2021, 12, 8, 1, 9, 12, 925557)),
 (6, 'Addie', 'Mesias', 'amesias2@twitpic.com', False, 'ih7Y69u56', 'U', True, datetime.datetime(2021, 12, 8, 1, 9, 12, 925557), datetime.datetime(2021, 12, 8, 1, 9, 12, 925557))]

In [10]:
%sql SELECT user_id, user_email_validated, is_active FROM users

 * postgresql://sms_user:***@localhost:5432/sms_db
6 rows affected.

[(2, True, True),
 (3, True, True),
 (4, True, True),
 (5, True, True),
 (6, True, True),
 (1, True, True)]

In [9]:
%%sql

UPDATE users
SET
    user_email_validated = true,
    is_active = true

 * postgresql://sms_user:***@localhost:5432/sms_db
6 rows affected.

[]

In [11]:
%sql SELECT user_id, user_email_validated, is_active FROM users

 * postgresql://sms_user:***@localhost:5432/sms_db
6 rows affected.

[(2, True, True),
 (3, True, True),
 (4, True, True),
 (5, True, True),
 (6, True, True),
 (1, True, True)]

In [12]:
%sql SELECT user_id, user_email_id FROM users

 * postgresql://sms_user:***@localhost:5432/sms_db
6 rows affected.

[(2, 'donald@duck.com'),
 (3, 'mickey@mouse.com'),
 (4, 'gbradock0@barnesandnoble.com'),
 (5, 'tlyness1@paginegialle.it'),
 (6, 'amesias2@twitpic.com'),
 (1, 'scott@tiger.com')]

In [14]:
%%sql

UPDATE users
SET
    user_email_id = upper(user_email_id)

 * postgresql://sms_user:***@localhost:5432/sms_db
6 rows affected.

[]

In [15]:
%sql SELECT user_id, user_email_id FROM users

 * postgresql://sms_user:***@localhost:5432/sms_db
6 rows affected.

[(2, 'DONALD@DUCK.COM'),
 (3, 'MICKEY@MOUSE.COM'),
 (4, 'GBRADOCK0@BARNESANDNOBLE.COM'),
 (5, 'TLYNESS1@PAGINEGIALLE.IT'),
 (6, 'AMESIAS2@TWITPIC.COM'),
 (1, 'SCOTT@TIGER.COM')]

In [16]:
%%sql

ALTER TABLE users ADD COLUMN user_full_name VARCHAR(50)

 * postgresql://sms_user:***@localhost:5432/sms_db
Done.

[]

In [17]:
%sql SELECT user_id,user_first_name, user_last_name, user_full_name FROM users

 * postgresql://sms_user:***@localhost:5432/sms_db
6 rows affected.

[(2, 'Donald', 'Duck', None),
 (3, 'Mickey', 'Mouse', None),
 (4, 'Gordan', 'Bradock', None),
 (5, 'Tobe', 'Lyness', None),
 (6, 'Addie', 'Mesias', None),
 (1, 'Scott', 'Tiger', None)]

In [19]:
%sql SELECT concat(user_first_name, ' ' , user_last_name) FROM users

 * postgresql://sms_user:***@localhost:5432/sms_db
6 rows affected.

[('Donald Duck',),
 ('Mickey Mouse',),
 ('Gordan Bradock',),
 ('Tobe Lyness',),
 ('Addie Mesias',),
 ('Scott Tiger',)]

In [21]:
%%sql
UPDATE users
    SET user_full_name = upper(concat(user_first_name, ' ' , user_last_name))

 * postgresql://sms_user:***@localhost:5432/sms_db
6 rows affected.

[]

In [22]:
%sql SELECT user_id,user_first_name, user_last_name, user_full_name FROM users

 * postgresql://sms_user:***@localhost:5432/sms_db
6 rows affected.

[(2, 'Donald', 'Duck', 'DONALD DUCK'),
 (3, 'Mickey', 'Mouse', 'MICKEY MOUSE'),
 (4, 'Gordan', 'Bradock', 'GORDAN BRADOCK'),
 (5, 'Tobe', 'Lyness', 'TOBE LYNESS'),
 (6, 'Addie', 'Mesias', 'ADDIE MESIAS'),
 (1, 'Scott', 'Tiger', 'SCOTT TIGER')]